uniformizeSurfIntPnts(Surface!System.Runtime.CompilerServices.IsConst*,Surface!System.Runtime.CompilerServices.IsConst*,Arr&lt;EdgePnt&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,Arr&lt;EdgePnt&gt;*,System.Boolean,System.Boolean)
Given an array of EdgePnts representing the intersection of two surfaces, replace the points
by (almost) uniformly spaced points uniformizeSurfIntPnts representing the intersection curve.
If optional input "bReduce" is true, this function will attempt to reduce the number of
intersection points without violating Revit's tessellation requirements. If you know that the
two surfaces are tangent, set optional input "bSurfsAreKnownToBeTangent" to true (this will
improve performance and avoid misguided attempts to refine the intersection points).